In [3]:
import pandas as pd

# Create a number map with 10 'a' as chars

In [4]:
frame = pd.DataFrame({"numbers": range(10), "chars" : ["a"]*10})

In [5]:
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

# read_csv - cчитывание данных со стандартным разделителем и работать, как с таблицей

In [6]:
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [7]:
frame

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN

# counts - вовзращает список имен столбцов

In [8]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

# shape - возвращает кортеж, в котором первое число - количество строк, второе число - количество столбцов

In [9]:
frame.shape

(5, 4)

In [10]:
new_line = {'Name' : "Perov", 'Birth' : "22.03.1990", 'City' : 'Penza'}

# append -  добавление словаря в текущую таблицу, работает Inplace, то есть вовзвращает копию данных

In [11]:
frame.append(new_line, ignore_index=True)

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN
5    Perov  22.03.1990      Penza            NaN

In [12]:
frame

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN

# таким образом можно изменить таблицу, то есть просто присвоить

In [13]:
frame = frame.append(new_line, ignore_index=True)

In [14]:
frame

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN
5    Perov  22.03.1990      Penza            NaN

# добавление столбца
## обращение как к словарю, указываем - создаем, конкатенация построчных значений
### при этом функция работает не Inplace!!

In [20]:
frame['Isstudent'] = 0

In [16]:
frame

      Name       Birth       City       Position
0   Иванов  22.03.1980     Москва            NaN
1  Сорокин  07.08.1965  Волгоград        Инженер
2    Белов  13.02.1980     Ростов       менеджер
3  Питюгов  16.01.1952     Москва  Дата-саентист
4    Мехно  02.10.1956     Якутск            NaN
5    Perov  22.03.1990      Penza            NaN

# удаление строк и столбцов
## указываем номера строк в таблице, и ось по которой идет удаление; 0 - строка, 1 - столбец
### работает inplace!

In [21]:
frame.drop([3,2], axis=0)

      Name       Birth       City Position  Isstudent
0   Иванов  22.03.1980     Москва      Nan      False
1  Сорокин  07.08.1965  Волгоград  Инженер      False

In [22]:
frame

      Name       Birth       City  Position  Isstudent
0   Иванов  22.03.1980     Москва       Nan      False
1  Сорокин  07.08.1965  Волгоград   Инженер      False
2    Белов  13.02.1980     Ростов  менеджер       True
3    Perov  22.03.1990      Penza       NaN       True

In [23]:
frame = frame.drop([3,2], axis=0)

In [24]:
frame

      Name       Birth       City Position  Isstudent
0   Иванов  22.03.1980     Москва      Nan      False
1  Сорокин  07.08.1965  Волгоград  Инженер      False

In [31]:
frame.drop('Isstudent', axis=1, inplace = True)

KeyError: "['Isstudent'] not found in axis"

In [32]:
frame

      Name       Birth       City Position
0   Иванов  22.03.1980     Москва      Nan
1  Сорокин  07.08.1965  Волгоград  Инженер

# to_csv - запись dataframe в файл

In [ ]:
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=None)